rails-app-flyway/app/controllers/posts_controller.rb

SELECT `posts`.* FROM `posts`
SELECT `resumes`.* FROM `resumes` WHERE `resumes`.`post_id` IN (1, 2, 4, 5, 6)
---
	def index
		@post = Post.all
    @post = Post.includes(:resumes)

INSERT INTO `posts` (`title`, `body`, `created_at`, `updated_at`) VALUES ('sdada', 'sadasda', '2019-12-20 06:51:52', '2019-12-20 06:51:52')
---
	def create
	  @post = Post.new(post_params)
	  @post.save

UPDATE `posts` SET `title` = 'Simran', `body` = 'MIshra', `updated_at` = '2019-12-23 10:17:18' WHERE `posts`.`id` = 6
---
  def update
   	@post.update(post_params)