rails-app-flyway/app/controllers/resumes_controller.rb

  def index
    @resumes = Resume.all
---
SELECT `resumes`.* FROM `resumes`

  def create
    @resume = @post.resumes.new(resume_params)
    if @resume.save
---
INSERT INTO `resumes` (`post_id`, `name`, `attachment`, `created_at`, `updated_at`) VALUES (1, 'test', 'siddhesh_dalvi.pdf', '2019-12-23 07:52:51', '2019-12-23 07:52:51')

  def destroy
    @resume = Resume.find(params[:id])
    @resume.destroy
---
SELECT  `resumes`.* FROM `resumes` WHERE `resumes`.`id` = 1 LIMIT 1
DELETE FROM `resumes` WHERE `resumes`.`id` = 1