rails-app-flyway/app/views/posts/show.html.erb

SELECT `resumes`.* FROM `resumes` WHERE `resumes`.`post_id` = 1
---
  <tbody>
    <% @post.resumes.each do |resume| %>